FaiyuetCik/Display-Gadgets/code/example/114_ESP32/0715_DashBoard_114_ESP32/0715_DashBoard_114_ESP32.ino
/*
  XIAO ESP32-S3 Plus + 1.14 Inch Display
  Factory Dashboard v1.2.4 - I2C hot-plug tolerant monitor

  Based on:
    - 0522_DashBoard_114_nRF52840.ino
    - 0521_DashBoard_114_ESP32.ino
    - completed ESP32-S3 1.47 Dashboard BAT state-machine path

  Goals:
    - Keep the nRF52840 Plus 1.14 Dashboard visual style and card layout.
    - Keep ESP32-S3 peripherals from the previous 0521 bring-up:
        LCD, Grove I2C scan, IMU, PDM mic, USR1/USR2/USR3.
    - Add ESP32-S3 D16 voltage sense display:
        D16 ADC voltage + calculated external voltage through divider ratio.
        This is voltage reference only, not battery-presence or charge-state detection.

  1.14 board:
    - LCD: ST7789 135x240, IPS=true, offset 52/40/53/40
    - No Touch
    - No SD
    - Grove I2C
    - 3 user buttons:
        USR1: cycle brightness 100/75/50/25/0%
        USR2: screen off / restore brightness
        USR3: toggle title Hello,XIAO! / Seeed
*/

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <WiFi.h>
#include <Arduino_GFX_Library.h>
#include "esp_idf_version.h"

#if ESP_IDF_VERSION_MAJOR >= 5
  #include <driver/i2s_pdm.h>
#else
  #include <driver/i2s.h>
#endif

#include <driver/gpio.h>
#include <esp_system.h>
#include <math.h>

// ========================= Build switches =========================

#define LCD_USE_ESP32SPI 1
#define REDUCE_PDM_CLK_DRIVE 1

// ========================= Timing =========================

static constexpr uint32_t UI_FAST_MS = 120;
static constexpr uint32_t UI_SLOW_MS = 260;
static constexpr uint32_t UI_VU_MS = 60;
static constexpr uint32_t SERIAL_MS = 600;
static constexpr uint32_t I2C_SCAN_MS = 8;     // one address per step; full 0x08-0x77 sweep is about 0.9 s
static constexpr uint32_t I2C_SETTLE_MS = 180; // require SDA/SCL high continuously before resuming after hot-plug
static constexpr uint32_t I2C_NOTICE_MS = 700; // briefly show that a bus change was detected
static constexpr uint32_t I2C_CLOCK_HZ = 100000; // safest common speed for unknown Grove I2C devices
static constexpr uint32_t BAT_REFRESH_MS = 350;
static constexpr uint32_t VSENSE_UI_MS = 1000;      // D16/Calc display check interval
static constexpr float VSENSE_D16_DELTA_V = 0.02f; // avoid 0.01V ADC jitter redraw
static constexpr float VSENSE_CALC_DELTA_V = 0.05f;
static constexpr uint32_t BTN_DEBOUNCE_MS = 35;
static constexpr uint32_t BTN_ACTION_LOCKOUT_MS = 150;
static constexpr uint32_t TAP_DEBOUNCE_MS = 220;

// ========================= LCD parameters =========================

static constexpr int LCD_W = 135;
static constexpr int LCD_H = 240;

static constexpr int LCD_ROTATION = 0;
static constexpr bool LCD_IPS = true;

static constexpr int LCD_COL_OFFSET_1 = 52;
static constexpr int LCD_ROW_OFFSET_1 = 40;
static constexpr int LCD_COL_OFFSET_2 = 53;
static constexpr int LCD_ROW_OFFSET_2 = 40;

// ========================= MIC parameters =========================

static constexpr int MIC_SAMPLE_RATE_HZ = 16000;
static constexpr bool MIC_CLK_INVERT = false;
static constexpr size_t MIC_SAMPLES_PER_READ = 256;

// Display-only scaling, tuned for the 1.14 block VU.
static constexpr float MIC_DISPLAY_SCALE = 2400.0f;

// ========================= Battery =========================
//
// BAT monitor policy:
//   1. Is a real battery connected?
//   2. If connected, what is the approximate battery percentage?
//   3. Do NOT infer charging state.
//
// Divider:
//   VBAT -- 316K -- ADC -- 160K -- GND
//   ratio = 476K / 160K = 2.975

static constexpr float BAT_R_TOP_KOHM        = 316.0f;
static constexpr float BAT_R_BOTTOM_KOHM     = 160.0f;
static constexpr float BAT_DIVIDER_RATIO     = (BAT_R_TOP_KOHM + BAT_R_BOTTOM_KOHM) / BAT_R_BOTTOM_KOHM;
static constexpr float BAT_CAL_FACTOR        = 1.000f;

static constexpr float BAT_VALID_MIN_V       = 2.80f;
static constexpr float BAT_VALID_MAX_V       = 4.60f;
static constexpr uint16_t BAT_PRESENT_MIN_MV = 850;
static constexpr uint16_t BAT_FLOAT_RANGE_MV = 90;

static constexpr uint8_t BAT_VALID_CONFIRM_COUNT = 3;
static constexpr uint8_t BAT_INVALID_CONFIRM_COUNT = 3;

// USB-only cold boot guard.
// Observed on 1.47: USB-only can show a stable fake ~70%.
// Trade-off: a real high-SOC battery-only cold boot can also be rejected.
static constexpr bool BAT_COLD_BOOT_HIGH_AS_USB = true;
static constexpr int  BAT_COLD_BOOT_SUSPECT_PCT = 60;

// Reject impossible high jump after a known real battery.
static constexpr float BAT_IMPOSSIBLE_JUMP_V     = 0.28f;
static constexpr int   BAT_IMPOSSIBLE_JUMP_PCT   = 22;
static constexpr uint8_t BAT_FLOAT_REJECT_STREAK = 2;

// Reinsert unlock after FLOAT_LOCK.
static constexpr float BAT_REINSERT_DROP_V       = 0.16f;

// USB-first then battery-insert compensation.
// Observed on 1.47: true 27%, USB-first insertion showed 39%, USB unplug returned to 27%.
static constexpr float BAT_USB_INSERT_SURFACE_COMP_V = 0.085f;
static constexpr float BAT_USB_INSERT_RELEASE_DROP_V = 0.045f;
static constexpr float BAT_EFFECTIVE_MIN_V           = 3.25f;

// UI percentage limiter.
static constexpr uint32_t BAT_PCT_RISE_INTERVAL_MS = 90000;

// ADC sampling.
static constexpr uint8_t BAT_SAMPLE_COUNT = 12;
static constexpr uint16_t BAT_SAMPLE_DELAY_US = 700;

// ========================= Pins =========================

static constexpr uint8_t MIC_CLK_PIN   = D0;
static constexpr uint8_t MIC_DATA_PIN  = D1;
static constexpr uint8_t LCD_CS_PIN    = D2;
static constexpr uint8_t LCD_DC_PIN    = D3;
static constexpr uint8_t I2C_SDA_PIN   = D4;
static constexpr uint8_t I2C_SCL_PIN   = D5;
static constexpr uint8_t BTN_A_PIN     = D6;   // USR1
static constexpr uint8_t BTN_B_PIN     = D7;   // USR2
static constexpr uint8_t LCD_SCK_PIN   = D8;
static constexpr uint8_t LCD_MISO_PIN  = D9;   // NC, unused by LCD
static constexpr uint8_t LCD_MOSI_PIN  = D10;
static constexpr uint8_t I2S_SD_PAD    = D11;
static constexpr uint8_t I2S_SCK_PAD   = D12;
static constexpr uint8_t I2S_WS_PAD    = D13;
static constexpr uint8_t IMU_INT_PIN   = D14;
static constexpr uint8_t BAT_ADC_PIN   = D16;
static constexpr uint8_t LCD_RST_PIN   = D17;
static constexpr uint8_t LCD_BL_PIN    = D18;
static constexpr uint8_t BTN_C_PIN     = D19;  // USR3

// ========================= Colors =========================

