FaiyuetCik/Display-Gadgets/code/example/114_ESP32/0715_DashBoard_114_ESP32/0715_DashBoard_114_ESP32.ino
// D16 voltage row is narrow on the 1.14-inch UI. Use one compact full-row
// string and clear the whole inner row before drawing to avoid residual pixels.
static constexpr int VSENSE_ROW_X = 7;
static constexpr int VSENSE_ROW_W = 122;
static constexpr int VSENSE_ROW_CHARS = 20;

// ========================= Helpers =========================

static int16_t le16(const uint8_t *p) {
  return (int16_t)((uint16_t)p[0] | ((uint16_t)p[1] << 8));
}

static bool i2cWrite8(uint8_t addr, uint8_t reg, uint8_t val) {
  if (!g_i2cAccessAllowed) return false;
  Wire.beginTransmission(addr);
  Wire.write(reg);
  Wire.write(val);
  return Wire.endTransmission() == 0;
}

static bool i2cRead(uint8_t addr, uint8_t reg, uint8_t *buf, size_t len) {
  if (!g_i2cAccessAllowed) return false;
  Wire.beginTransmission(addr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;

  size_t got = Wire.requestFrom((int)addr, (int)len);
  if (got != len) return false;

  for (size_t i = 0; i < len; i++) {
    buf[i] = Wire.read();
  }
  return true;
}

static bool i2cRead8(uint8_t addr, uint8_t reg, uint8_t *val) {
  return i2cRead(addr, reg, val, 1);
}

static String padRight(const String &s, int width) {
  String out = s;
  while ((int)out.length() < width) out += ' ';
  if ((int)out.length() > width) out = out.substring(0, width);
  return out;
}

static uint16_t colorByPercent(int p) {
  if (p < 15) return C_RED;
  if (p < 35) return C_ORANGE;
  if (p < 60) return C_YELLOW;
  return C_GREEN;
}

static int lipoPercent(float v) {
  struct Point { float v; int p; };
  static const Point table[] = {
    {4.20f, 100},
    {4.10f, 90},
    {4.00f, 80},
    {3.92f, 70},
    {3.85f, 60},
    {3.79f, 50},
    {3.72f, 40},
    {3.66f, 30},
    {3.58f, 20},
    {3.50f, 10},
    {3.30f, 0}
  };

  if (v >= table[0].v) return 100;
  if (v <= table[10].v) return 0;

  for (int i = 0; i < 10; i++) {
    if (v <= table[i].v && v >= table[i + 1].v) {
      float t = (v - table[i + 1].v) / (table[i].v - table[i + 1].v);
      return table[i + 1].p + (int)roundf(t * (table[i].p - table[i + 1].p));
    }
  }

  return 0;
}

static uint8_t currentBacklightPwm() {
  return BL_LEVELS[g_blIndex];
}

static int currentBacklightPercent() {
  return BL_LABELS[g_blIndex];
}

static void applyBacklight() {
  pinMode(LCD_BL_PIN, OUTPUT);
  analogWrite(LCD_BL_PIN, currentBacklightPwm());
}

static void cycleBacklightLevel() {
  g_blIndex = (g_blIndex + 1) % BL_LEVEL_COUNT;
  if (currentBacklightPwm() > 0) {
    g_blRestoreIndex = g_blIndex;
  }
  applyBacklight();
}

static void toggleBacklightOffRestore() {
  if (currentBacklightPwm() == 0) {
    if (BL_LEVELS[g_blRestoreIndex] == 0) g_blRestoreIndex = 0;
    g_blIndex = g_blRestoreIndex;
  } else {
    g_blRestoreIndex = g_blIndex;
    g_blIndex = BL_LEVEL_COUNT - 1;
  }
  applyBacklight();
}

// ========================= LCD / UI drawing =========================

static void acquireForLcd() {
  pinMode(LCD_CS_PIN, OUTPUT);
  digitalWrite(LCD_CS_PIN, HIGH);
  delayMicroseconds(2);
}

static bool initLcd() {
  // Keep the backlight off while the ST7789 is being reset and initialized.
  // This avoids showing a long black flash if the MCU restarts after a hot-plug transient.
  pinMode(LCD_BL_PIN, OUTPUT);
  analogWrite(LCD_BL_PIN, 0);

  pinMode(LCD_CS_PIN, OUTPUT);
  digitalWrite(LCD_CS_PIN, HIGH);

#if LCD_USE_ESP32SPI
  bool ok = gfx->begin(40000000);
#else
  bool ok = gfx->begin();
#endif

  if (!ok) {
    g_lcdOk = false;
    Serial.println("[LCD] begin failed");
    return false;
  }

  gfx->fillScreen(C_BLACK);
  gfx->setTextWrap(false);

  g_lcdOk = true;
  Serial.println("[LCD] OK 1.14 ST7789 135x240");
  return true;
}

static bool printTextFixed(int x, int y, uint16_t color, const String &s, int widthChars) {
  if (!g_lcdOk) return false;
  acquireForLcd();
  gfx->setTextSize(1);
  gfx->setTextColor(color, C_BLACK);
  gfx->setCursor(x, y);
  gfx->print(padRight(s, widthChars));
  return true;
}

static void drawCard(int x, int y, int w, int h, uint16_t accent, const char *title) {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->drawRoundRect(x, y, w, h, 5, accent);
  gfx->drawRoundRect(x + 1, y + 1, w - 2, h - 2, 5, C_LINE);
  gfx->fillRect(x + 4, y + 9, 3, h - 18, accent);
  gfx->setTextSize(1);
  gfx->setTextColor(accent, C_BLACK);
  gfx->setCursor(x + 12, y + 8);
  gfx->print(title);
}

static void drawVuFrame() {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->drawRoundRect(VU_X, VU_Y, VU_W, VU_H, 3, C_GREEN);
  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 2 + i * (VU_SEG_W + VU_GAP);
    gfx->fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, C_BLACK);
  }
}

static bool drawBatteryIcon(bool valid, int percent) {
  if (!g_lcdOk) return false;
  acquireForLcd();

  int x = BAT_ICON_X;
  int y = BAT_ICON_Y;
  gfx->fillRect(x - 1, y - 1, BAT_ICON_W + 5, BAT_ICON_H + 2, C_BLACK);

  uint16_t outline = valid ? C_WHITE : C_GRAY;
  uint16_t fillColor = valid ? colorByPercent(percent) : C_RED;

  gfx->drawRoundRect(x, y, BAT_ICON_W, BAT_ICON_H, 2, outline);
  gfx->fillRect(x + BAT_ICON_W, y + 3, 3, 4, outline);

  if (!valid) {
    gfx->drawLine(x + 3, y + 2, x + BAT_ICON_W - 3, y + BAT_ICON_H - 3, C_RED);
    gfx->drawLine(x + BAT_ICON_W - 3, y + 2, x + 3, y + BAT_ICON_H - 3, C_RED);
    return true;
  }

  int fillW = map(percent, 0, 100, 0, BAT_ICON_W - 4);
  fillW = constrain(fillW, 0, BAT_ICON_W - 4);
  if (fillW > 0) gfx->fillRect(x + 2, y + 2, fillW, BAT_ICON_H - 4, fillColor);
  return true;
}

static void drawHeaderTitle() {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->fillRect(0, 0, LCD_W, 20, C_BLACK);
  gfx->setTextColor(C_GREEN, C_BLACK);

  if (g_headerShowSeeed) {
    gfx->setTextSize(2);
    gfx->setCursor(37, ROW_TITLE);
    gfx->print("Seeed");
  } else {
    gfx->setTextSize(2);
    gfx->setCursor(1, ROW_TITLE);
    gfx->print("Hello,XIAO!");
  }
}

static void drawStaticLayout() {
  if (!g_lcdOk) return;
  acquireForLcd();
  gfx->fillScreen(C_BLACK);

