FaiyuetCik/Display-Gadgets/code/example/114_ESP32/0715_DashBoard_114_ESP32/0715_DashBoard_114_ESP32.ino
  drawHeaderTitle();

  gfx->setTextSize(1);
  gfx->setTextColor(C_CYAN, C_BLACK);
  gfx->setCursor(6, ROW_SUB1);
  gfx->print("1.14 Inch Display");
  gfx->drawFastHLine(6, 31, 123, C_LINE);

  drawCard(CARD_X, Y_SYS, CARD_W, H_SYS, C_CYAN, "SYS");
  gfx->setTextColor(C_WHITE, C_BLACK);
  // D16 row is drawn as one compact dynamic line by updateUiFast().
  gfx->setCursor(14, ROW_GROVE);
  gfx->print("I2C");

  drawCard(CARD_X, Y_IMU, CARD_W, H_IMU, C_YELLOW, "MOTION");
  gfx->setTextColor(C_YELLOW, C_BLACK);
  gfx->setCursor(88, ROW_TAP);
  gfx->print("Tap 0");
  gfx->setTextColor(C_WHITE, C_BLACK);
  gfx->setCursor(14, ROW_ACC);
  gfx->print("A");
  gfx->setCursor(14, ROW_GYR);
  gfx->print("G");

  drawCard(CARD_X, Y_MIC, CARD_W, H_MIC, C_GREEN, "MIC LEVEL");
  drawVuFrame();

  drawCard(CARD_X, Y_BL, CARD_W, H_BL, C_BLUE, "BACKLIGHT");

  gfx->fillRect(0, ROW_PRODUCT - 1, LCD_W, 12, C_BLACK);
  gfx->setTextColor(C_YELLOW, C_BLACK);
  gfx->setCursor(13, ROW_PRODUCT);
  gfx->print("XIAO ESP32-S3 Plus");

  cache_micRaw = "";
  cache_acc = "";
  cache_gyr = "";
  cache_tap = "";
  cache_bat = "";
  cache_d16_adc = "";
  cache_d16_calc = "";
  g_d16ShownVadc = -1.0f;
  g_d16ShownCalc = -1.0f;
  cache_grove = "";
  cache_key = "";
  cache_bl = "";
  cache_batIconState = -1;
  g_cachedVuSegments = -1;
}

// ========================= I2C / IMU =========================

static bool i2cDeviceListsEqual(const uint8_t *a, uint8_t aCount,
                                const uint8_t *b, uint8_t bCount) {
  if (aCount != bCount) return false;
  for (uint8_t i = 0; i < aCount; i++) {
    if (a[i] != b[i]) return false;
  }
  return true;
}

static bool i2cLinesReleased() {
  // Read the pin levels without changing the ESP32 pin matrix configuration.
  return gpio_get_level((gpio_num_t)I2C_SDA_PIN) == 1 &&
         gpio_get_level((gpio_num_t)I2C_SCL_PIN) == 1;
}

static void printI2cScanResult() {
  Serial.print("[I2C] scan:");
  if (!g_i2cCount) {
    Serial.print(" none");
  } else {
    for (uint8_t i = 0; i < g_i2cCount; i++) {
      Serial.printf(" 0x%02X", g_i2cDevices[i]);
    }
  }
  if (g_i2cScanFaultCount) {
    Serial.printf(" faultCount=%u", g_i2cScanFaultCount);
  }
  Serial.println();
}

static void beginI2cSettle(uint8_t addr, uint8_t err) {
  // Fail open: stop all I2C traffic, but leave LCD, mic, buttons and UI alive.
  // Keep the previous stable address list on screen until a clean sweep completes.
  g_i2cMonitorPhase = I2C_MONITOR_SETTLE;
  g_i2cAccessAllowed = false;
  g_i2cLinesHighSinceMs = 0;
  g_i2cNextCount = 0;
  g_i2cScanAddr = 0x08;
  g_i2cScanFault = true;
  g_i2cLastFaultAddr = addr;
  g_i2cLastFaultCode = err;
  g_i2cNoticeUntilMs = millis() + I2C_NOTICE_MS;

  if (g_i2cScanFaultCount < 255) g_i2cScanFaultCount++;

  Serial.printf("[I2C] hot-plug/bus fault addr=0x%02X err=%u; pause bus, keep UI alive\n",
                addr, err);
}

static void serviceI2cSettle() {
  uint32_t now = millis();

  if (!i2cLinesReleased()) {
    g_i2cLinesHighSinceMs = 0;
    return;
  }

  if (g_i2cLinesHighSinceMs == 0) {
    g_i2cLinesHighSinceMs = now;
    return;
  }

  if (now - g_i2cLinesHighSinceMs < I2C_SETTLE_MS) return;

  // Do not Wire.end() or toggle SDA/SCL here. Those aggressive recovery methods
  // can create additional pin/power disturbances. A released bus is simply
  // resumed at the conservative universal speed.
  Wire.setClock(I2C_CLOCK_HZ);
  Wire.setTimeOut(8);

  g_i2cAccessAllowed = true;
  g_i2cMonitorPhase = I2C_MONITOR_SCAN;
  g_i2cScanFault = false;
  g_i2cNextCount = 0;
  g_i2cScanAddr = 0x08;
  g_i2cLinesHighSinceMs = 0;

  Serial.println("[I2C] lines stable; resume clean address sweep");
}

static void commitI2cScan() {
  bool changed = !i2cDeviceListsEqual(g_i2cDevices, g_i2cCount,
                                      g_i2cNextDevices, g_i2cNextCount);

  if (changed) {
    g_i2cCount = g_i2cNextCount;
    for (uint8_t i = 0; i < g_i2cCount; i++) {
      g_i2cDevices[i] = g_i2cNextDevices[i];
    }

    cache_grove = ""; // force the I2C row to redraw on the next UI tick
    g_i2cNoticeUntilMs = millis() + I2C_NOTICE_MS;
    printI2cScanResult();
  }

  g_i2cNextCount = 0;
  g_i2cScanAddr = 0x08;
  g_i2cScanFault = false;
}

static void scanI2cBus() {
  if (g_i2cMonitorPhase == I2C_MONITOR_SETTLE) {
    serviceI2cSettle();
    return;
  }

  // Catch connector bounce before starting another I2C transaction.
  if (!i2cLinesReleased()) {
    beginI2cSettle(g_i2cScanAddr, 0xFE); // synthetic code: physical line held low
    return;
  }

  if (g_i2cScanAddr > 0x77) {
    commitI2cScan();
    return;
  }

  // Exactly one address is probed per call. This bounds the blocking time of
  // the monitor and prevents an entire scan burst from starving the LCD UI.
  uint8_t addr = g_i2cScanAddr++;

  Wire.beginTransmission(addr);
  uint8_t err = Wire.endTransmission(true);

  if (err == 0) {
    if (g_i2cNextCount < sizeof(g_i2cNextDevices)) {
      g_i2cNextDevices[g_i2cNextCount++] = addr;
    }
  } else if (err == 4 || err == 5) {
    // ESP32 Wire commonly reports 4/5 for bus error or timeout.
    beginI2cSettle(addr, err);
  }
  // err=2/3 is a normal NACK during scanning and is intentionally ignored.
}

static bool initQmi(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x00, &who)) return false;
  if (who == 0x00 || who == 0xFF) return false;

  i2cWrite8(addr, 0x02, 0x60);
  i2cWrite8(addr, 0x03, 0x03);
  i2cWrite8(addr, 0x04, 0x53);
  i2cWrite8(addr, 0x08, 0x03);
  delay(20);

  uint8_t data[12] = {};
  if (!i2cRead(addr, 0x35, data, sizeof(data))) return false;

  g_imuType = IMU_QMI8658;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] QMI8658-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

static bool initLsm(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x0F, &who)) return false;
  if (who != 0x69 && who != 0x6A && who != 0x6C) return false;

  i2cWrite8(addr, 0x10, 0x60);
  i2cWrite8(addr, 0x11, 0x60);
  delay(20);

  g_imuType = IMU_LSM6DS3;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] LSM6-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

